{
  "url": "https://www.nytimes.com/2020/12/04/podcasts/daily-newsletter-nyc-food-bank-vaccine-coronavirus.html",
  "post_data": null,
  "page_data": {
    "title": "Becoming a Part of the Story",
    "subtitle": "How our day at the food pantry hit close to home. Plus, your questions about vaccine distribution, answered.",
    "authors": [
      "Jessica Guynn",
      "Bob Bobbert"
    ],
    "publisher": "NYTIMES",
    "publish_date": null,
    "publish_date_time": "2020-10-05T19:50:33Z",
    "body": "Hey, hey everybody — Happy Friday. Our team is on the hunt for new things to watch this weekend, having ripped through “The Queen’s Gambit” and “The Undoing” during our days off for Thanksgiving, so email us any recommendations you’ve got! After resurfacing from our carbo-induced couch comas, here’s what we covered on the show this week. On Monday, we investigated when and how you might get a coronavirus vaccine. On Tuesday and Wednesday, we examined the careers of President-elect Joe Biden’s cabinet picks, beginning with Janet Yellen for Treasury Secretary, followed by Antony Blinken for Secretary of State. On Thursday, one man shared his story of sexual abuse while in the Boy Scouts, and on Friday, we analyzed President Trump’s pre-emptive pardons. If you’re looking for a weekend binge, our Podcast Club recommends “Tom Brown’s Body,” a true-crime series about the mysterious disappearance of one teenage boy in Texas. And for a little delight, here’s a video of the host Michael Barbaro responding to Sho Shibuya’s artwork of The Daily. I enjoy the anonymity of journalism. We write the story. We report the story. We are not the story. But I’m a human being with feelings and experiences that inform my reporting. My emotions and memories of the way my family went in and out of poverty spilled over in a recent episode of The Daily. On a Friday in September, I stood outside a food pantry operated by Council of Peoples Organization, or COPO, with the producers Stella Tan and Annie Brown. The line for food stretched around the block in Midwood, Brooklyn, and people had positioned carts on the ground overnight to save their places in line. I had seen lines like that before. I’d spoken in the past to plenty of people who use pantries. But that day, we met a woman who told us it was easier to be in the line because she was wearing a mask, and no one would recognize her. She said she was also comforted by the length of the line — evidence she was not alone. Turning away, I lost it right there, happy to have been wearing glasses to hide the tears welling in my eyes. Later, as I recounted the day with Stella and Austin Mitchell, another producer, I offhandedly talked about my experience with food insecurity as a child. They asked me, though not wanting to push, if I would be willing to share my thoughts with listeners. ar, I worked on a book about Troop 6000, formed in a homeless shelter in Queens. I asked the Scouts, their troop leaders and their parents to share intimate details about themselves at the most difficult times in their lives. I also watched girls evolve from being ashamed about their homelessness to openly explaining the obstacles and injustices of poverty. Couldn’t I, shouldn’t I, do the same? Ultimately, I decided to share my stories of food stamps, free lunch and food insecurity. As I said in the episode, if we all keep this secret of poverty, past or present, it creates a stigma where there shouldn’t be one. If we talk openly, we can do something about it. ",
  "citation_urls": [
            "https://www.nytimes.com/2020/11/30/podcasts/the-daily/covid-vaccine.html",
			"https://www.nytimes.com/2020/12/01/podcasts/the-daily/joe-biden-janet-yellen.html",
			"https://www.nytimes.com/2020/12/02/podcasts/the-daily/joe-biden-antony-blinken-foreign-policy.html",
			"https://www.nytimes.com/2020/12/03/podcasts/the-daily/boy-scouts-sexual-abuse.html",
			"https://www.nytimes.com/2020/12/04/podcasts/the-daily/donald-trump-pardons.html?action=click&module=Briefings&pgtype=Homepage",
			"https://www.nytimes.com/2020/11/25/podcasts/the-daily/new-york-city-food-pantries.html",
			"https://www.nytimes.com/2020/11/30/podcasts/the-daily/covid-vaccine.html",
			"https://www.nytimes.com/2020/03/27/podcasts/the-daily/kids-coronavirus.html",
			"https://www.nytimes.com/interactive/2020/science/coronavirus-vaccine-tracker.html",
			"https://www.nytimes.com/newsletters/the-daily?te=1&nl=the-daily&emc=edit_dy_20190627"
    ],
    "html": null
  }
}