{
  "url": "https://www.sciencedirect.com/science/article/pii/S187770581101993X/pdf?md5=1590f27d9c611eba275dbc0d9e1ee457&pid=1-s2.0-S187770581101993X-main.pdf",
  "post_data": null,
  "page_data": {
    "title": "Measurement and analysis for lithium battery of high-rate discharge performance",
    "subtitle": null,
    "authors": [
      "Huai Chuangfeng",
      "Liu Pingan",
	  "Sun, Yang-Kook"    
	  ],
    "publisher": "SciVerse ScienceDirect",
    "publish_date": "2011",
    "publish_date_time": "2011-10-05T19:50:33Z",
    "body": "Abstract High-rate lithium battery is the object researched by electric-chemical experts due to the increasing of miniaturization and high-power devices. In this paper, measure and analysis their high-rate discharge performance for two kinds mainstream lithium battery of lithium polymer and LiFePO4 Battery. The results show that lithium polymer battery is more effective than LiFePO4 Battery in constant-current discharge performance, power density and energy density. But in safety charge-discharge and durability, LiFePO4 Battery has some advantages. Key Words: Lithium Polymer; LiFePO4 Battery; High-rate Discharge; Performance Measurement 1. Introduction As the development of microelectronics techno- logy in twentieth century, the miniaturization devices have increasing more and more popular, this made of very high power requirements for batteries, following lithium batteries them into a large-scale practical use [1,2]. With the energy shortage and global environ- mental pressure, lithium batteries are now more widely used in electric vehicles, satellites, aerospace and energy storage, etc., especially the emergence of LiFePO4 battery that driven lithium battery into industry development and application [3-5]. Today, as more and more situation needs for high-current power supply, the higher performance of a higher power requirement. Now, there are a few kinds battery can achieve high current 80A continuous discharge, and the large current discharge performance for battery of the research literature is relatively small [6-9]. This paper researches a large ∗  Huai Chuangfeng. Tel.: 0-86-791-7046138 E-mail address: hcf811225@163.com. This paper is supported by DEF of Jiangxi(Gjj11102) Open access under CC BY-NC-ND license. © 2011 Published by Elsevier Ltd. Selection and/or peer-review under responsibility of [CEIS 2011] Open access under CC BY-NC-ND license. 2620 Huai Chuangfeng et al. / Procedia Engineering 15 (2011) 2619 – 2623 2 Huai Chuangfeng，et al / Procedia Engineering 00 (2011) 000–000 current discharge performance of lithium batteries based on analyze the battery discharge curve cluster, take a representative lithium-polymer battery (LiPo) and LiFePO4 battery (A123) for example, research a large current discharge performance of lithium batteries, comparative analysis of the performance of two batteries, therefore, provide reference data for engineering applications of the lithium power. 2. Nominal battery performance In the analysis, first to explain the battery nominal perform- ance. Typically, lithium are series and parallel use, the battery factory performance generally are rated voltage and battery capacity.  Rated voltage refers to the battery voltage, and battery capacity, that uses C to denote, is the amount of power obtained from the battery, the unit is Ah or mAh. In fact, C has another layer of meaning that is used to describe the relationship of capacity of battery and the discharge capacity. Take 5Ah battery for example, 1C means 5A continuous current discharge capacity and 10C means 50A, 30C means 150A, and so on. Therefore, the lithium battery specifications C also denotes the maximum output current that battery can withstand. There are sub-rate and short-term continuous C ratio for the battery nominal perform- ance, and C ratio usually means the continuous C rate. 3. Discharge performance of LiPo There is divergent to define C-rate of lithium battery, in this section, the interpretation of C rate is based on the actual measurement value.  Fig.1 is a discharge curves clusters of Korean series battery about LiPo's 3.7V, 5Ah, 25C. Take discharge midpoint at 2500mAh, read the voltage value. At the maximum rated C rate (25C), voltage value dropped by about 0.37V in comparision with no-load value. The figure does not include noload voltage value curve, but we can infer its position according to the 10C-5C-0C value.  Fig.2 is a discharge curve cluster of domestic LiPo battery about 14.8V, 5Ah, 35C. At discharge midpoint of the maximum rated C rate (35C), voltage value dropped by about 1.2V in comparision with no-load value, it’s 0.3V for each battery cell.  Fig. 1 Discharge curves clusters of LiPo Fig. 2 Discharge curves clusters of LiPo  Thus, we can gain the rule that different brands (China or Korean) with different specifications (25C, 35C) in the maximum rated C rate discharge has dropped 0.3 ~ 0.4V/cell, and LiPo battery nominal voltage is 3.7V, there is ten times the relationship to dropped voltage. Define this as: the maximum C rate is equal to the output current when the voltage dropped to 90% no-load voltage. According to the above inference, in the full C rate discharge, there is 370mV voltage dropped that arising from the internal resistance in battery as shown in Fig.3. Therefore, the corresponding current is  Huai Chuangfeng Huai Chuangfeng et al. / Procedia Engineering 15 (2011) 2619 – 2623 ， 2621 Liu Pingan，Jia Xueyan / Procedia Engineering 00 (2011) 000–000 3 = 370 RI i Fig. 3 Simple model of battery Fig. 4 Discharge curves clusters of A123 If the battery capacity is Ah, the C rate is i ×== AhRAhIC )(370 Obtained from the above equation i ×= AhCR )(370 Unit: mΩ For example, a 5Ah, 30C battery, the internal resistance should be Ri = ×= Ω 370 (5 30) 2.47 Unit: m For multi-chip battery pack at the number of S in series, above equation can be extended to ⎩ ⎨ ⎧ ××= ××= )()370( )()370( R AhCS AhRSC i i Therefore, a good battery of enough C is (370 ) ( ) Unit: m (23 C) R S C Ah i ≤× × Ω o There is important to note the temperature for producing an intense effect on internal resistance of battery. LiPo's temperature dropped ten degrees, the internal resistance increased exponentially. In other words, the performance of a 30C battery in summer is likely to become 10C in winter. Many cases show that LiPo battery is very likely to tympanites when use it in winter, even if not over-discharge. The reason is that internal resistance become larger when temperature low, this result in the battery’s maintain voltage 3.4V/cell as original full C rate discharge falling in the 2.5V to 3.0V or even less at cold weather, and causing similar injuries as over-discharge. 4. Discharge Performance of A123 Unlike LiPo battery, A123 cell is quite simple to use and can be fast charge and discharge with high current. In addition, overcharge and over discharge for A123 cell had no effect on battery performance. Therefore, A123 cell has many applications in industry. In this section, the author analyzes its performance from two points of view. Point 1: Output performance with constant voltage. A123 battery nominal voltage is 3.3V, and thus modifies the formula i ×== AhRAhIC )(330 Take Into the original data C =×= 3.14)3.210(330 Is A123 really a 14C battery? For another calculation method, look at the discharge curve cluster for original battery as shown in Fig.4  2622 Huai Chuangfeng et al. / Procedia Engineering 15 (2011) 2619 – 2623 4 Huai Chuangfeng，et al / Procedia Engineering 00 (2011) 000–000  The point that remaining 90% no-load voltage is 2.9V, where the corresponding discharge current is approximately 25A. It can be seen that the actual capacity is 2.25Ah, then C = = 1.11Ah25.2A25 . The actual equivalent internal resistance in Fig.4 is R = (3.25V-2.7V)/(40A-1A)=14.1. Therefore, A123 is equivalent to about 11C ~ 12C battery from the similar definition of LiPo's. Point 2: Discharge capacity at the premise of no damage to the battery. A123 has 70A continuous discharge capacity from the original data. Then, C = 70/2.3 = 30.4, the voltage dropped is 70A × 14.1mΩ ≈ 1V, about 1 / 3 to no-load voltage. Self-heating power of each cell is 70A2 × 0.014 = 68.6W. Therefore, excluding the voltage dropped and power loss, A123’s ultimate discharge capacity is about 30C. At this time forced cooling is something we have to watch out for. 5. Experimental Performance A123 Battery experimental configuration Battery: 2.3Ah, 3.3V A123. 8S2P, 26.4V, 4.6Ah, 8S2P means that eight single cells in series, then, two external in parallel. Weight is1228g and volume is 788 cm3 . Load: Brushless motor with ultimate 3000W power. Price: Second-hand battery is 12 Yuan per cell and new is 120 Yuan per cell. LiPo battery experimental configuration Battery: 2.6Ah, 3.7V LiPo battery with the 25C discharge coefficient (brand omitted), and has been used about 10 charge-discharge cycles. 6S2P, 22.2V, 5.2Ah. Weight is 792g and volume is 406 cm3 . Load: Brushless motor with ultimate 3000W power. Price: 6S1P, 2.6Ah, 25C LiPo is about 500 Yuan. Voltage and current data would be collected by test equipment Eagle Tree elogger V3 with 10 points / sec sampling rate, as shown in Fig.5 and Fig.6.  Fig. 5(a) Discharge curves clusters Fig. 5(b) Point of maximum current  Fig. 6(a) Discharge curves clusters Fig. 6(b) Point of maximum current Comparison of these charts and we can found (1) Maximum current and maximum power of two batteries is similar from the view at ultimate value, but there is relatively the large difference from the voltage side.  Huai Chuangfeng Huai Chuangfeng et al. / Procedia Engineering 15 (2011) 2619 – 2623 ， 2623 Liu Pingan，Jia Xueyan / Procedia Engineering 00 (2011) 000–000 5 (2) At the point of ultimate current value, the dis- charge current can approximately achieve 120A. The voltage of A123 battry dropped about 6V inhere and LiPo’s voltage dropped 3V. (3) The voltage of A123 cells has a slow recovery process after experienced a heavy load. (4) Battery internal resistance can be estimated from the data of Figure, A123 battery as shown in Fig.5(b), the voltage dropped 6.2V with the current of 120A, then the internal resistance R = 51.7 mΩ, converted to each monomer, internal resistance r = 12.9 mΩ. LiPo battery as shown in Fig.6(b), the voltage dropped 3.0V with the current of 118A, then the internal resistance R = 25.4 mΩ, converted to each monomer, internal resistance r = 8.47 mΩ. Therefore, we gained the result data as follow Power / mass density: A123 = 1.94 KW/kg LiPo = 2.91 KW/kg Energy / mass density: A123 = 98.9Wh/kg LiPo = 146Wh/kg Power / volume density: A123 = 3.03W/cm3 LiPo = 5.67 W/cm3 Energy / volume density: A123 = 0.154Wh/cm3 LiPo = 0.284 Wh/cm3 Economy: Secondhand A123 = ￥1.58/Wh New A123 = ￥15.8/Wh LiPo = ￥8.66/Wh. 6. Conclusions and discussion  (1) The total internal resistance of A123 is almost double than LiPo’s, but two battery equally get a similar output power. The reason is that A123 battery pack to the 8S, and the total voltage is high than LiPo’s, which partly compensate the power loss of A123’s caused by large voltage drop. (2)Taking into account the capacity differences between the two battery, the power density of 7~8S A123 is equivalent to 6S, 25C LiPo’s. The perfor- mance of A123 for over-current, over-charge and overdischarge is much higher than the LiPo’s. A123 has lower power density and energy density, which is equivalent to 2/3 LiPo’s with 25C rate, at same weight. Else, with same volume term, A123's power density and energy density is only equivalent to 1/2 LiPo’s with 25C rate. References  [1] Zheng Ruding. General on the Lithium-ion Battery and Lithium Polymer Battery[J]．Telecom Power Technologies, 2002, 6: 18-21． [2] Sha Yongkang. Conception of the Lithium-ion Battery and Lithium Polymer Battery[J]. Electric Bicycle, 2009, 9: 30-32． [3] Zhang Hucheng, Xuan Xiaopeng, Wang Jianji. Advances in Ionic Conductivity of Lithium Polymer Electrolytes[J]. Chemistry, 2003, 66(2): 142-147． [4] Jiang Zhijun. Development and challenge of LiFePO_4 cathode materials for Li-ion batteries[J]．Journal of Functional Materials，2010，41(3): 1118-1124． [5] Li Yuan, Li Shaomin, Chen Liang. Research progress and prospects of lithium iron phosphate as lithium-ion bakery cathode material [J]．Chinese Journal of Power Sources, 2010, 34(9): 963-966． [6] Mei Qunbo, Du Naiying, Liang Liyan. Synthesis and Characterization of High Molecular Weight Polymers Containing 8- Hydroxyquinoline Lithium Complexes[J]. Chinese Journal of Luminescence, 2006, 27(6): 1000- 1006． [7] Hu Guorong, Tong Hui, Zhang Xinlong. Study on preparation and electrochemical performance of cathode material LiFePO4[J]，Chinese Journal of Power Sources, 2007, 31(3): 233-236． [8] Zhao Shuhong, Wu Feng, Wang Zidong. Study on operating mode cycle performance of lithium ion power battery with natural graphite and LiFePO4[J], Electronic Components & Materials, 2009, 28(11): 43-47． [9] Xie Xiaohua, Zhang Jian, Li Jia. STUDY ON THE LOW TEMPERATURE PERFORMANCE OF THE LiFePO4/Li BATTERIES[J]. Journal of South China Normal University（Natural Science Edition）, 2009, Z2: 113-115．", 
	"citation_urls": [
			"http://creativecommons.org/licenses/by-nc-nd/3.0/",
            "http://creativecommons.org/licenses/by-nc-nd/3.0/",
			
    ],
    "html": null
  }
}