{
  "url": "https://www.usatoday.com/story/money/2020/10/05/trump-defeats-covid-commemorative-coins-on-sale-gift-shop/3628383001/",
  "post_data": null,
  "page_data": {
    "title": "You can preorder a $100 'Trump defeats COVID' commemorative coin at White House Gift Shop",
    "subtitle": "The $100 “Trump defeats COVID” coins are for sale on the website of the White House Gift Shop, which is not affiliated with the White House.",
    "authors": [
      "Jessica Guynn",
      "Bob Bobbert"
    ],
    "publisher": "USA TODAY",
    "publish_date": null,
    "publish_date_time": "2020-10-05T19:50:33Z",
    "body": "Intensifying his efforts to undo his loss to Joseph R. Biden Jr., President Trump twice called the Republican speaker of the Pennsylvania House of Representatives in recent days to encourage challenges to the official results in the state.  Mr. Trump pressed the speaker, Bryan Cutler, on how Republicans planned to reverse the results of an election that Mr. Biden was certified to have won by more than 80,000 votes, a spokesman for Mr. Cutler, Michael Straub, said Monday night.  “He did ask what options were available to the legislature,” Mr. Straub said, referring to the president.  A series of lawsuits by the Trump campaign and its allies claiming widespread voting fraud in Pennsylvania have been tossed out of state and federal courts.  Supporters of Mr. Trump’s baseless fraud claims have called on Republican-led legislatures in several states to overturn the results, although Pennsylvania’s General Assembly is out of session and cannot be called back except by Gov. Tom Wolf, a Democrat.  “Cutler made it very clear what power the legislature has and does not have,” said Mr. Straub, who characterized the president’s calls as seeking information rather than pressuring the speaker. The calls were reported earlier by The Washington Post.   ImageBryan Cutler, the speaker of the Pennsylvania House of Representatives, spoke with President Trump twice in recent days. Bryan Cutler, the speaker of the Pennsylvania House of Representatives, spoke with President Trump twice in recent days.Credit...Dan Gleiter/The Patriot-News, via Associated Press Pennsylvania is the third state in which Mr. Trump is known to have reached out to top elected Republicans to try to reverse the will of voters. He earlier summoned Michigan legislative leaders to the White House, and over the weekend he pressed Gov. Brian Kemp of Georgia to call upon that state’s legislature to reverse the election.  At a rally in Georgia on Saturday, Mr. Trump said Mr. Kemp “could stop it very easily if he knew what the hell he was doing.” But Mr. Kemp has repeatedly declined to call for a special session of the legislature, and state election officials recertified Georgia’s results on Monday after another recount again showed that Mr. Biden had won the state.  Nearly every state has certified its results, and Mr. Biden has officially secured more than the 270 Electoral College votes needed to become president.  In Pennsylvania, Mr. Biden was certified the winner last month by the Department of State, and Mr. Wolf signed a “certificate of ascertainment” for Mr. Biden’s slate of electors to be appointed to the Electoral College, which votes on Dec. 14.  Nonetheless, 64 Republicans in the General Assembly, including Mr. Cutler and other members of the leadership, called on Friday for Pennsylvania’s congressional delegation to reject the electoral votes for Mr. Biden when Congress meets on Jan. 6 to confirm the Electoral College results. The effort is highly unlikely, not least because the Democratic-led House of Representatives would need to agree to it. Pennsylvania’s most senior congressional Republican, Senator Pat Toomey, has said through his office that he “will not be objecting” to Mr. Biden’s 20 electoral votes from the state.  Mr. Trump’s personal attacks on the few top Republicans who debunk his fraud claims, such as in Georgia and Arizona, as well as his efforts to enlist allies in the party in his brazen effort to reverse the will of voters, such as in Pennsylvania, are likely to make the issue crucial to elections next year and in the 2022 midterms. Republican primaries could become contests of who stood behind Mr. Trump in his baseless claims that undermined faith in democracy.  State Representative Joanna E. McClinton, the minority leader of the Pennsylvania House Democrats, called Republican assertions of widespread fraud, which have echoed Mr. Trump’s descent into conspiracy theories and disinformation, “outrageous.”  “We are seeing extremists who claim they love the Constitution,” she said, “but who want to throw the Constitution away just because the president lost his bid for re-election.",
    "citation_urls": [
            "https://www.google.com/",
            "https://www.4chan.org/"
    ],
    "html": null
  }
}